<?php
/**
 * Created by PhpStorm.
 * User: JHR
 * Date: 2018/9/18
 * Time: 19:56
 */
return [
        '-5' => 'token不能为空',
        '-4' => '非法参数',
        '-3' => '无效的token',
        '-2' => '数据不能为空',
        '-1' => '操作失败',
        '1' => '操作成功',
        '2' => '登录失败',
        '3' => '请传入图片',
        '4' => '订单不存在或状态已改变',
        '5' => '无效的图片',
        '6' => '无效的手机号',
        '7' => '无效的邮箱',
        '8' => '最多上传9张图片',
        '9' => '图片上传失败',
        '10' => '最多上传1张图片',
        '11' => '1分钟内不可重复发送',
        '12' => '短信发送失败',
        '13' => '无效的身份证号',
        '14' => '请传入作品',
        '15' => '最多上传6张图片',
        '16' => '验证码无效',
        '17' => '验证码已过期',
        '18' => '上传身份证正反面',
        '19' => '请传入资质证书',
        '20' => '图片存在中文名或超过2M',
        '21' => '图片格式无效',
        '22' => '图片大小超出限制',
        '23' => '机构名称不能为空',
        '24' => '当前角色状态无法发布需求',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
];