<?php
/**
 * Created by PhpStorm.
 * User: JHR
 * Date: 2018/9/18
 * Time: 19:56
 */
return [
        '-5' => 'token不能为空',
        '-4' => '非法参数',
        '-3' => '无效的token',
        '-2' => '数据不能为空',
        '-1' => '操作失败',
        '1' => '操作成功',
        '2' => '登录失败',
        '3' => '请传入图片',
        '4' => '订单不存在或状态已改变',
        '5' => '无效的图片',
        '6' => '无效的手机号',
        '7' => '无效的邮箱',
        '8' => '最多上传9张图片',
        '9' => '图片上传失败',
        '10' => '最多上传1张图片',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
        '' => '',
];